# AnalyticalElement Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalElement Class
Members See Also
---
Base class for a structural analytical elements. AnalyticalElement represents the analytical portion of a given Structural Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AnalyticalElement : Element
```

Visual Basic
---
```text
Public Class AnalyticalElement _
	Inherits Element
```

Visual C++
---
```text
public ref class AnalyticalElement : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..AnalyticalElement Autodesk.Revit.DB.Structure..::..AnalyticalMember Autodesk.Revit.DB.Structure..::..AnalyticalSurfaceBase
# See Also
AnalyticalElement Members
Autodesk.Revit.DB.Structure Namespace